/*
 * @Author: 聂芳 nie4161204@qq.com
 * @Date: 2023-02-17 17:44:43
 * @LastEditors: 聂芳 nie4161204@qq.com
 * @LastEditTime: 2024-03-10 10:55:04
 * @FilePath: /vue3-frog-admin/src/constants/duilian.js
 * @Description: 对联枚举
 *
 */
export const duilianTags = [
  {
    value:"楹联",
    label:"楹联"
  },
  {
    value:"婚联",
    label:"婚联"
  },
  {
    value:"春联",
    label:"春联"
  },
  {
    value: '四字联',
    label: '四字联'
  },
  {
    value: '五字联',
    label: '五字联'
  },
  {
    value: '七字联',
    label: '七字联'
  },
  {
    value: '同旁部首联',
    label: '同旁部首联',
    desc: '同联部首相同，经过精心构思，利用偏旁、部首相同的汉字组成的对联。'
  },
  {
    value: '复字联',
    label: '复字联',
    desc: '在对联中，将一个或几个字按照某种规律重复使用多次，称为复字联。'
  },
  {
    value: '拆字联',
    label: '拆字联',
    desc: '拆字，也称析字，离合，是将汉字的字形各部分拆离开，使之成为另几个字（或形），并赋于各字（或形）以新的意义。'
  },
  {
    value: '嵌字联',
    label: '嵌字联',
    desc: '将特定的名称嵌入对联中一定的位置，有嵌人名、地名、药名等。'
  },
  {
    value: '谐音联',
    label: '谐音联',
    desc: '利用语音相谐一语双关，起到妙趣丛生的效果。'
  },
  {
    value: '隐字联',
    label: '隐字联',
    desc: '在联中有意识地将某些字略掉，把成语典故、古人名句、俚言俗语融入联中。“隐字联”既含而不露，又使人一目了然，在对联的众多形式中自成一格。'
  },
  {
    value: '数字联',
    label: '数字联',
    desc: '数字联即在对联中嵌入数字，使数量词在对联中有某种特殊的意义，枯燥乏味的数字经文人之手，嵌入对联之中，就会产生意想不到的奇妙效果，令对联朗朗上口。'
  },
  {
    value: '叠字联',
    label: '叠字联',
    desc: '在对联中，分别有一个字或数个同样的字相继重叠出现，为叠字联。'
  },
  {
    value: '合字联',
    label: '合字联',
    desc: '合字联，就是把联中的某几个字合成一个新的字，来达到斗趣乃至表情达意的形式。'
  },
  {
    value: '回文联',
    label: '回文联',
    desc: '用回文形式写成的对联，既可顺读，也可倒读。不仅它的意思不变，而且颇具趣味。'
  },
  {
    value: '顶针联',
    label: '顶针联',
    desc: '顶针联，亦称联珠对、联锦对、连连对，是指对联的前一个分句的句脚字，作为后一个分句的句头字，使相邻的两个分句，首尾相连，一气呵成。'
  },
  {
    value: '无情对',
    label: '无情对',
    desc: '无情对只讲究上下联字词相对，至于内容则各讲各的，绝不相干，使人产生奇谲难料，回味不尽的妙趣。'
  },
  {
    value: '流水对',
    label: '流水对',
    desc: '流水对属近体诗中的一种，是指出句与对句在意义上和语法结构上不是相对，而是上下相承，两句不能互相脱离，更不能颠倒，在语言结构上有一定的前后秩序。'
  },
  {
    value: '同字异音',
    label: '同字异音',
    desc: '用多音字组成的对联。'
  },
  {
    value: '歧义联',
    label: '歧义联',
    desc: '一副对联有两种意思。'
  },
  {
    value: '戏答联',
    label: '戏答联',
    desc: '下联对上联进行巧妙回应。'
  },
  {
    value: '谜语联',
    label: '谜语联',
    desc: '上下联分别为一个谜面。'
  },
]
